{
"About": {
  "Name": "Aryan Bataan",
  "Currently": "Computer Science Student",
  "Headshot": "IMG_3552.jpg",
  "Thumbnail": "student-logo.webp",
  "AboutText": "Hi, I am Aryan Bataan. I am a passionate computer science student with a keen interest in software development and programming. Currently, I am pursuing my undergraduate degree at Seattle Pacific University. I am dedicated to expanding my knowledge and skills in various areas of computer science, with a particular focus on C++ programming.<br><br>I enjoy tackling challenging programming projects and I thrive in collaborative environments where I can contribute my expertise and learn from my peers.<br><br>Beyond the classroom, I actively engage in extracurricular activities related to computer science, including hackathons, coding competitions, and open-source contributions. I believe in the importance of continuous learning and seek out opportunities to explore new technologies and methodologies."
},
"Contact": {
  "LinkedIn": "linkedin.com/in/aryan-bataan",
  "GitHub": "github.com/AryanB11"
},
"Experience": {
  "ExperienceText": "I am currently pursuing a Bachelor of Science in Computer Science at Seattle Pacific University. Since starting my academic journey, I have focused on gaining practical experience in the modern workplace, developing proficiency in multiple programming languages, and maintaining a strong balance between academics and extracurricular activities.",
  "School": "Seattle Pacific University",
  "Major": "Computer Science",
  "Graduation": "Expected to gradute in June 2025",
  "Employment": "Boeing (January 2024 - August 2024)",
  "Role": "Field Technician",
  "EmploymentText": "During my time at Boeing, I was tasked with re-imaging laptops and desktops to ensure they were configured correctly for end-users. This involved preparing systems with the latest operating systems and required software, tailored to specific departmental needs. Alongside this, I managed computer refresh equipment swaps, where outdated hardware was replaced with new, optimized devices. These swaps were seamless transitions for users, ensuring minimal disruption to their workflow.",
  "Internship": "Reboot Chronicles (May 2024 - Present)",
  "Title": "Product Development & QA Intern",
  "InternshipText": "I enhance and apply my skills in integrating NodeJS to develop custom back-end functionalities, implementing advanced JavaScript solutions to extend application capabilities and ensure seamless performance. I design and execute QA strategies, identifying and documenting bugs, verifying features against specifications, and delivering a smooth user experience through rigorous testing. I define and prioritize product features, develop custom solutions beyond standard WordPress capabilities, and implement complex functionalities using JavaScript. Additionally, I contribute to back-end development, ensure seamless integration with WordPress, and assist in testing advanced features to meet specifications and deliver a robust user experience.",
  "Skills": ["Python, JavaScript, HTML/CSS, C++, React Native, C#, Java, C, Prolog, Go, NodeJS"],
  "SkillsText": "My programming experience spans a diverse range of languages, each contributing to my growth as a developer. Python has been a cornerstone for data analysis, machine learning, and automation, allowing me to solve complex problems with simplicity and efficiency. JavaScript and NodeJS are central to my expertise in web development, enabling me to build dynamic interfaces and scalable back-end systems. While HTML/CSS provide the structural foundation for web applications, React Native extends my capabilities to create cross-platform mobile solutions. I’ve tackled high-performance challenges with C++ and explored memory management and system-level programming with C, while Java and C# have equipped me to develop scalable enterprise and Android applications. Go has been invaluable for its concurrency features, especially in building modern, efficient systems, and Prolog offered insights into logical programming and AI problem-solving. Each language is a unique tool I’ve honed to adapt to the challenges of software development.",
  "Resume": "Resume-1.pdf"  
},
"Project1": {
    "Title": "Create and Evaluate an Expression Tree",
    "Desc": "CSC2431 Lab.<br><br>In this lab, I created an expression tree from a postfix arithmetic expression, focusing on dynamic memory allocation and tree traversal techniques. I implemented Inorder, Preorder, and Postorder traversals to explore the expression in different notations and evaluated the arithmetic expression stored in the tree. Additionally, I generated a detailed step-by-step JSON output showing the evaluation process, highlighting how values propagate through the tree structure. This lab deepened my understanding of binary trees and their practical applications in data representation and computation.",
    "GitHubRepo": "https://github.com/csc2431-spring2023/postfix-to-expression-tree-AryanB11",
    "MainImage": "expr-tree2.png",
    "DetailImages": ["P1Detail1.png","P1Detail2.png","P1Detail3.png"]
  },
  "Project2": {
    "Title": "Infix to Postfix",
    "Desc": "CSC2431 Lab.<br><br>In this lab, I developed a program to convert arithmetic expressions from infix notation, commonly used by humans, to postfix notation, which is more efficient for computers to process. Using the C++ Standard Template Library (STL) stack and implementing a general algorithm, I created a class to handle the conversion process. This involved parsing and applying operator precedence, handling parentheses, and constructing the postfix expression. Through this lab, I enhanced my understanding of stack-based algorithms, class design, and operator precedence, solidifying key concepts in data structures and algorithm implementation.",
    "GitHubRepo": "https://github.com/csc2431-spring2023/infix-to-postfix-AryanB11",
    "MainImage": "Infix.png",
    "DetailImages": ["P2Detail1.png","P2Detail2.png","P2Detail3.png","P2Detail4.png"]
  },
  "Project3": {
    "Title": "Implementing the Abstract Data Type List",
    "Desc": "CSC2431 Lab.<br><br>In this lab, I implemented various data structures to explore the practical application of Abstract Data Types (ADT) for lists. This included developing the DoubleLinkedList class to represent an ADT List using a doubly linked list, the VSArray class to implement a dynamically resizable array-based list, and the SortedDoubleLinkedList class, a specialized version of the doubly linked list designed to maintain sorted order. Through this lab, I honed my skills in pointer manipulation, dynamic memory management, and the principles of inheritance while reinforcing my understanding of ADT List implementations.",
    "GitHubRepo": "https://github.com/csc2431-spring2023/list-AryanB11",
    "MainImage": "List.png",
    "DetailImages": ["P1Detail1.png","P1Detail2.png","P1Detail3.png"]
  },
  "Project4": {
    "Title": "",
    "Desc": "",
    "GitHubRepo": "",
    "MainImage": "",
    "DetailImages": []
  }
}
